[
    "A group of flamingos is called a 'flamboyance'.",
    "Octopuses have three hearts and blue blood.",
    "Honey never spoils. Archaeologists have found pots of honey in ancient Egyptian tombs that are over 3,000 years old and still edible.",
    "The shortest war in history was between Britain and Zanzibar on August 27, 1896. Zanzibar surrendered after 38 minutes.",
    "Bananas are berries, but strawberries are not.",
    "Wombat poop is cube-shaped.",
    "An astronaut's height can change by up to 2 inches when they are in space due to the lack of gravity.",
    "The inventor of the Pringles can is now buried in one.",
    "Koalas have fingerprints that are nearly identical to human fingerprints, so much so that they have been mistaken for human prints at crime scenes.",
    "A day on Venus is longer than a year on Venus.",
    "Cows have best friends and get stressed when they are separated.",
    "In Japan, there is a train station with no entrance or exit; it’s just there for the view.",
    "A jiffy is an actual unit of time; it’s 1/100th of a second.",
    "Sharks have been around longer than trees.",
    "The heart of a shrimp is located in its head.",
    "You can hear a blue whale's heartbeat from more than 2 miles away.",
    "Butterflies taste with their feet.",
    "The shortest complete sentence in the English language is 'I am.'",
    "Some cats have a condition called polydactylism, where they have extra toes.",
    "A sneeze travels about 100 miles per hour.",
    "The human nose can remember 50,000 different scents.",
    "Dolphins have names for each other.",
    "There’s a species of jellyfish that is essentially immortal.",
    "A single strand of spaghetti is called a 'spaghetto.'",
    "The Eiffel Tower can be 15 cm taller during the summer due to thermal expansion.",
    "The unicorn is Scotland's national animal.",
    "A small child could swim through the veins of a blue whale.",
    "You can fit all the planets in our solar system between the Earth and the Moon.",
    "The longest time between two twins being born is 87 days.",
    "The shortest war ever fought was between the British Empire and the Sultanate of Zanzibar on August 27, 1896. Zanzibar surrendered after 38 minutes.",
    "A group of owls is called a 'parliament.'",
    "The longest word in the English language is pneumonoultramicroscopicsilicovolcanoconiosis, a type of lung disease caused by inhaling very fine silicate or quartz dust.",
    "Cleopatra lived closer in time to the Moon landing than to the construction of the Great Pyramid of Giza.",
    "The shortest complete sentence in the English language is 'I am.'",
    "The world’s largest desert is not the Sahara, but Antarctica.",
    "An octopus has three hearts and blue blood.",
    "A day on Mercury lasts 59 Earth days.",
    "The inventor of the microwave appliance only received $2 for his discovery.",
    "The oldest known living tree is over 5,000 years old.",
    "The unicorn is Scotland’s national animal.",
    "Slugs have four noses.",
    "There are more stars in the universe than grains of sand on all the world’s beaches.",
    "A group of frogs is called an 'army.'",
    "A snail can sleep for three years.",
    "An adult human is made up of approximately 37.2 trillion cells.",
    "The only letter that doesn’t appear in any U.S. state name is Q.",
    "The most expensive coffee in the world comes from beans that have been eaten and excreted by a civet cat.",
    "You can fit all the planets in our solar system between the Earth and the Moon.",
    "A small child could swim through the veins of a blue whale.",
    "The longest time between two twins being born is 87 days.",
    "Butterflies have taste sensors on their feet.",
    "Sharks existed before trees.",
    "Dolphins have names for each other.",
    "There are more possible iterations of a game of chess than there are atoms in the known universe.",
    "A small child could swim through the veins of a blue whale.",
    "The average person walks the equivalent of five times around the world in their lifetime.",
    "The longest recorded flight of a chicken is 13 seconds.",
    "Koalas have fingerprints that are nearly identical to human fingerprints.",
    "There are more stars in the universe than grains of sand on all the world’s beaches.",
    "The moon has moonquakes.",
    "The average person produces enough saliva in their lifetime to fill two swimming pools.",
    "The human body contains enough iron to make a small nail.",
    "A newborn kangaroo is the size of a lima bean.",
    "Some turtles can breathe through their butts.",
    "The hottest planet in our solar system is Venus, not Mercury.",
    "A group of crows is called a 'murder.'",
    "A cat has 32 muscles in each ear.",
    "It rains diamonds on Jupiter and Saturn.",
    "A crocodile cannot stick its tongue out.",
    "The inventor of the Pringles can is buried in one.",
    "A sneeze travels about 100 miles per hour.",
    "A jiffy is an actual unit of time; it’s 1/100th of a second.",
    "The human nose can detect over 1 trillion different scents.",
    "Some cats are allergic to humans.",
    "There are no words in the English language that rhyme with 'orange.'",
    "A crocodile cannot stick its tongue out.",
    "Humans share 60% of their DNA with bananas.",
    "The most expensive pizza in the world costs $12,000 and takes 72 hours to make.",
    "Polar bear skin is black, not white.",
    "The longest recorded flight of a chicken is 13 seconds.",
    "A sneeze travels about 100 miles per hour.",
    "A small child could swim through the veins of a blue whale.",
    "You can fit all the planets in our solar system between the Earth and the Moon.",
    "An adult human is made up of approximately 37.2 trillion cells.",
    "Butterflies have taste sensors on their feet.",
    "An octopus has three hearts and blue blood.",
    "Sharks existed before trees.",
    "Dolphins have names for each other.",
    "The world’s largest desert is not the Sahara, but Antarctica.",
    "Slugs have four noses.",
    "There are more stars in the universe than grains of sand on all the world’s beaches.",
    "The longest time between two twins being born is 87 days.",
    "The average person walks the equivalent of five times around the world in their lifetime.",
    "There are more possible iterations of a game of chess than there are atoms in the known universe.",
    "Some turtles can breathe through their butts.",
    "The moon has moonquakes.",
    "A newborn kangaroo is the size of a lima bean.",
    "The average person produces enough saliva in their lifetime to fill two swimming pools.",
    "The hottest planet in our solar system is Venus, not Mercury.",
    "The first computer virus was created in 1983 and was called the 'Elk Cloner'.",
  "The first 1GB hard drive, introduced in 1980, weighed over 500 pounds and cost $40,000.",
  "The term 'bug' in computer science originated from a real moth found in a computer in 1947 by Grace Hopper.",
  "The world's first website, created by Tim Berners-Lee, is still online and can be visited.",
  "The QWERTY keyboard layout was designed to slow down typing to prevent typewriter jams.",
  "The first computer mouse was made of wood and was invented by Doug Engelbart in 1964.",
  "The original name for Windows 95 was 'Windows 4.0'.",
  "The first programming language was created by Ada Lovelace in the 19th century for Charles Babbage’s Analytical Engine.",
  "The term 'spam' for unwanted email comes from a Monty Python sketch.",
  "The world's first 3D printer was created in 1984 and was called the SLA-1.",
  "A single Google search uses more computing power than the Apollo 11 mission did to land on the moon.",
  "The world's first computer game, 'Tennis for Two', was created in 1958 and displayed on an oscilloscope.",
  "The first hard drive, introduced by IBM in 1956, could hold only 5MB of data.",
  "The concept of a 'debugging' tool was popularized by the story of Grace Hopper removing a moth from a computer.",
  "The first computer password was used by MIT students in the 1960s and was simply a string of letters and numbers.",
  "The programming language 'Python' is named after the Monty Python comedy group, not the snake.",
  "A computer’s CPU speed is measured in gigahertz (GHz), with 1 GHz equating to one billion cycles per second.",
  "The ‘404 Error’ code for a missing webpage is named after the room number where the error was first detected at CERN.",
  "The first smartphone was IBM’s Simon Personal Communicator, which was introduced in 1994.",
  "The first email was sent by Ray Tomlinson in 1971 to himself.",
  "The 'Turing Award' is named after Alan Turing, the father of theoretical computer science.",
  "The term 'cloud computing' comes from the practice of using a cloud symbol to represent the internet in diagrams.",
  "The first web browser was called 'WorldWideWeb' and was later renamed to 'Nexus'.",
  "The 'Hello World' program was used to demonstrate the simplicity of new programming languages and concepts.",
  "The programming language 'Java' was originally called 'Oak' after a tree outside the creator’s window.",
  "The first computer bug was a real moth that was discovered in a relay of the Harvard Mark II computer.",
  "The 'Doom' video game was one of the first to use 3D graphics and had a major influence on the gaming industry.",
  "The largest computer chip measures just 1 millimeter across but can contain billions of transistors.",
  "The first email was sent by Ray Tomlinson, and it was a test message that said 'QWERTYUIOP'.",
  "The term 'bit' is short for 'binary digit'.",
  "The first video game console was the Magnavox Odyssey, released in 1972.",
  "The first computer virus to spread in the wild was called 'Brain', created in 1986 in Pakistan and was the work of 2 brothers, Basit and Amjad Farooq Alvi.",
  "The term 'software engineering' was coined in 1968 at a conference on software engineering.",
  "The first computer 'bug' was a moth found in a computer relay by Grace Hopper.",
  "The first commercial computer, the UNIVAC I, was installed in the United States Census Bureau in 1951.",
  "The programming language 'C' was developed in the 1970s and is the basis for many modern programming languages.",
  "The first digital camera, developed by Kodak, was built in 1975 and had a resolution of 0.01 megapixels.",
  "The term 'open source' was coined in 1998 to describe software that is freely available and modifiable.",
  "The first algorithm intended to be processed by a machine was created by Ada Lovelace for Charles Babbage's Analytical Engine.",
  "The first website to offer online shopping was Amazon, which started selling books in 1994.",
  "The first computer graphics were created by a physicist named William Fetter in 1965.",
  "The average computer user will touch the keyboard 2,000 times a day.",
  "The world's first computer-generated animation was created by a computer scientist named Ed Catmull in 1972.",
  "The 'desktop' metaphor used in operating systems like Windows and MacOS was inspired by office workspaces.",
  "The world's first computer game, 'Spacewar!', was created in 1962 by Steve Russell and others at MIT.",
  "The world's first computer mouse was made out of wood and cost around $40 in the 1960s.",
  "The programming language 'Ruby' was named after a gemstone and was developed in the 1990s.",
  "The first computer 'bug' was a moth found in a computer relay by Grace Hopper in 1947.",
  "The 'Turing Test', proposed by Alan Turing in 1950, is used to determine if a machine exhibits intelligent behavior.",
  "The world's first email was sent by Ray Tomlinson in 1971 and was a test message sent to himself."
]
  